<?php
return [
    'contract_product' => [
        0=>'日策略',
        1=>'周策略',
        2=>'月策略'
    ],
    //产品的类型
    'contract_type' => [
        0=>'天配',
        1=>'周配',
        2=>'月配'
    ],
    // 支付方式
    'pay_type' => [
        0 => '银行卡',
        1 => '支付宝',
        2 => '微信',
        3 => '效益宝',
        4 => '聚合支付',
    ],
    // 第三方支付状态
    'pay_status' => [
        0 => '成功',
        1 => '处理中',
        2 => '已处理',
        3 => '已取消',
        9 => '待处理',

    ],
    // 交易类型
    'order_type' => [
        0 => '充值',
        1 => '提现',
        2 => '支付保证金',
        3 => '退回保证金',
        4 => '收到过夜费',
        5 => '交易手续费',
        6 => '退还过夜费',
        7 => '提现退还',
    ],
    // 客户层级
    'operate_type' => [
        1 => '运营商',
        2 => '会员',
        3 => '代理商',
    ],
    // 客户层级字段
    'operate_feild' => [
        1 => 'operate',
        2 => 'number',
        3 => 'agent',
    ],
    //策略流失类型
    // 交易类型
    'fund_order_type' => [
        0 => '转入策略金',
        1 => '终止策略转出',
        2 => '买票转出',
        3 => '卖票转入',
        4 => '撤单转入',
        5 => '补保转入',
        6 => '补保转出',
        7 => '取保转出',
        8 => '增加策略金',
        9 => '增加保证金',
        10 => '成交差价退还',
        11 => '订单结算',
    ],
    //后台角色类型
    'users_type'=>[
        0 => '系统管理员',
        1 => '运营主管',
        2 => '业务经理',
        3 => '产品运维',
        4 => '财务结算',
        5 => '风控人员',
    ],
    //后台角色类型
    'problems_type'=>[
        0 => '点买问题',
        1 => '清算问题',
        2 => '充值问题',
    ],
];
